"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Отредактировать функцию month_to_season, которая принимает номер месяца,
таким образом, чтобы она возвращала название сезона, к которому относится
этот месяц

ПРИМЕРЫ
--------------------------------------------------------------------------------
- month_to_season(12) -> 'Зима'
- month_to_season(4) -> 'Весна'
- month_to_season(7) -> 'Лето'
- month_to_season(9) -> 'Осень'
"""
seasons = ["Зима", 'Зима', 'Весна', 'Весна', 'Весна', 'Лето', 'Лето', 'Лето', 'Лето', 'Лето', 'Лето', "Зима"]
MONTH = dict(zip(range(1, 13), seasons))


def month_to_season(month: int) -> str:
    season = MONTH.get(month)
    return season


if __name__ == '__main__':
    month_number = int(input('Введите \
        номер месяца: '))
    print(f'Сезон: {month_to_season(month_number)}')
